# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
# Решение 1:
num = input("Введите число: ")
result = int(num[0]) + int(num[1]) + int(num[2])
print(num, "-> {} ({} + {} + {})".format(result, num[0], num[1], num[2]))