"""
ПОШЛА В ДЗ
Задача №21. Напишите программу для печати всех уникальных
значений в словаре.
Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
":" S007 "}]
Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
Примечание: Список словарей задан изначально.
Пользователь его не вводит
"""
list_dictionary = [{"V": "S0kjhk01"}, {"V": "S002"}, {"VI": "S001"},
{"VI": "S005"}, {"VII": "S005 "}, {" V ": " S009 "}, {" VIII":" S007 "}, {" VIII": " S007 "}, {" VIII": " S007 "}]
count = 0 # счетчик перебора
a = [] # пустой список
for i in list_dictionary:
    dictionary = i  # передаем словарь по индексу
    for j in dictionary:    # перебираем полученный словарь
        dictionary[j] = dictionary[j].strip()   # удаляем лишние пробелы
        a.insert(count, dictionary[j])
        count += 1
a = set(a)  # с помощью set() оставляем только уникальные значения
print(*a)   # печатаем результат
